IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DMASS0_RINGACC_0_RINGACC_ISC.xml
<module name="DMASS0_RINGACC_0_RINGACC_ISC" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="RINGACC_ISC_ISC_control" acronym="RINGACC_ISC_ISC_control" offset="0x0" width="32" description="The ISC a Region b Control Register defines the control fields for the ISC.">
		<bitfield id="NOPRIV" width="2" begin="27" end="26" resetval="0x0" description="Clear output priv attribute. If each bit is set then the outgoing priv bit is cleared. Has precedence over priv set bits." range="27 - 26" rwaccess="R/W"/> 
		<bitfield id="PRIV" width="2" begin="25" end="24" resetval="0x0" description="Set outgoing priv attribute. If each bit is set then the outgoing priv bit is set." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PASS" width="1" begin="21" end="21" resetval="0x0" description="No privID replacement, pass through value." range="21" rwaccess="R/W"/> 
		<bitfield id="NONSEC" width="1" begin="20" end="20" resetval="0x0" description="Make outgoing non-secure. Has precedence over secure enable bits." range="20" rwaccess="R/W"/> 
		<bitfield id="SEC" width="4" begin="19" end="16" resetval="0x0" description="Make outgoing secure. A value of 0xA enables, others disable." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PRIV_ID" width="8" begin="15" end="8" resetval="0x0" description="Priv ID." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="LOCK" width="1" begin="4" end="4" resetval="0x0" description="Lock region. Once set the region values cannot be modified." range="4" rwaccess="R/W1TS"/> 
		<bitfield id="ENABLE" width="4" begin="3" end="0" resetval="0x0" description="Enable region. A value of 0xA enables, others disable." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="RINGACC_ISC_ISC_control2" acronym="RINGACC_ISC_ISC_control2" offset="0x4" width="32" description="The ISC a Region b Control Register 2 defines the control fields for the ISC.">
		<bitfield id="PASS_V" width="1" begin="31" end="31" resetval="0x0" description="No virtID replacement, pass through value." range="31" rwaccess="R/W"/> 
		<bitfield id="ATYPE" width="2" begin="29" end="28" resetval="0x0" description="Defines the output address type. 0 = physical no memory attributes. 1 = intermediate. 2 = virtual. 3 = physical with memory attributes." range="29 - 28" rwaccess="R/W"/> 
		<bitfield id="VIRTID" width="12" begin="27" end="16" resetval="0x0" description="Virt ID." range="27 - 16" rwaccess="R/W"/>
	</register>
</module>